// ============================================================
// УРОК 2 — Умови, цикли, функції, масиви
// ============================================================

// Задача №1
// Що потрапить в консоль?
//   let someVar = 0;
//   ++someVar;
//   if (someVar) { 
//      console.log(someVar); 
//   }
// Запишіть результат як число або null (якщо нічого не виведеться)

const task1Answer = 1; // <- ваша відповідь


// Задача №2
// За допомогою циклу FOR виведіть рядки: "Пункт №1", "Пункт №2", ... "Пункт №10"
// Функція має повертати масив з 10 рядків

function task2() {
  const result = [];
  for(let i = 1; i < 11; ++i) {
result.push(`Пункт №${i}`)
}

  return result;
}
task2()


// Задача №3
// Що потрапить в консоль?
//   if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
//     console.log('000');
//   }
// Запишіть результат як рядок або null (якщо нічого не виведеться)

const task3Answer = null; // <- ваша відповідь


// Задача №4
// Функція ділення. Не має повертати NaN, Infinity або кидати помилку.
// Повертає рядок виду: "Результат ділення: 5"

function divide(a,b) {
let some = a/b;
let result=``;
if (typeof(a) !== 'number' || typeof(b) !== 'number') {
result+=`please, enter a number`;
} else if(b == 0 || b == null) {
result+=`please, enter a number more then 0`;
} else {
result+=`Результат ділення: ${some}`
} return result;
}
    
divide(10, 5);

// Задача №5
// Створіть масив із 5 елементів.
// За допомогою методу перебору перевірте,
// чи містить масив число 10.
// Поверніть true, якщо число знайдено, інакше false.

function task5() {
  const arr = ['HTML', 10, 'CSS', 20, 'JS']; // <- ваш масив (має містити число 10)
return arr.includes(10);
  // ваш код перебору тут
  // повертає true якщо знайдено 10, інакше false
}


module.exports = { task1Answer, task2, task3Answer, divide, task5 };
